app/controllers/api/items_controller.rb

   def create
     item = Item.new(item_params)

       if item.save
---
INSERT INTO "items" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-05-11 19:08:42.626243"], ["updated_at", "2017-05-11 19:08:42.626243"]]

     def update
   item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 4]]