app/controllers/api/lists_controller.rb

INSERT INTO "lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-05-11 19:04:04.392313"], ["updated_at", "2017-05-11 19:04:04.392313"]]
---
   def create
     list = List.new(list_params)
    if list.save!

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
def destroy
     begin
       list = List.find(params[:id])
       list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]
---
   def update
      list = List.find(params[:id])