app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Sterling"], ["password", "Archer"], ["created_at", "2017-05-05 19:31:29.162113"], ["updated_at", "2017-05-05 19:31:29.162113"]]
---
   def create
     user = User.new(user_params)
     if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
   def destroy
     begin
       user = User.find(params[:id])
       user.destroy